In [1]:
import common.ipynb_importer
from db.pg.pg_00_common import *

cursor = pg_connect()

importing Jupyter notebook from E:\sourcecode\keep_learning\db\pg\pg_00_common.ipynb

In [2]:
sql = """
CREATE TABLE employees (
    id SERIAL PRIMARY KEY,
    first_name VARCHAR(255) NOT NULL,
    last_name VARCHAR(255) NOT NULL,
    salary DECIMAL(10, 2) NOT NULL
);

CREATE TABLE managers(
    id SERIAL PRIMARY KEY,
    first_name VARCHAR(255) NOT NULL,
    last_name VARCHAR(255) NOT NULL,
    salary DECIMAL(10, 2) NOT NULL
);

INSERT INTO employees (first_name, last_name, salary) 
VALUES
('Bob', 'Williams', 75000.00),
('Charlie', 'Davis', 55000.00),
('David', 'Jones', 50000.00),
('Emma', 'Brown', 48000.00),
('Frank', 'Miller', 52000.00),
('Grace', 'Wilson', 49000.00),
('Harry', 'Taylor', 53000.00),
('Ivy', 'Moore', 47000.00),
('Jack', 'Anderson', 56000.00),
('Kate', 'Hill',  44000.00),
('Liam', 'Clark', 59000.00),
('Mia', 'Parker', 42000.00);

INSERT INTO managers(first_name, last_name, salary) 
VALUES
('John', 'Doe',  60000.00),
('Jane', 'Smith', 55000.00),
('Alice', 'Johnson',  58000.00);
"""

cursor.execute(sql)

In [3]:
sql = """
SELECT 
  * 
FROM 
  employees 
WHERE 
  salary = ANY (
    SELECT 
      salary 
    FROM 
      managers
  );
"""

run_sql(cursor, sql)

   id first_name last_name    salary
0   2    Charlie     Davis  55000.00

In [5]:
sql = """
SELECT 
  * 
FROM 
  employees 
WHERE 
  salary > ANY (
    SELECT 
      salary 
    FROM 
      managers
  );
"""

run_sql(cursor, sql)

   id first_name last_name    salary
0   1        Bob  Williams  75000.00
1   9       Jack  Anderson  56000.00
2  11       Liam     Clark  59000.00

In [4]:
sql = """
SELECT 
  * 
FROM 
  employees 
WHERE 
  salary < ANY (
    SELECT 
      salary 
    FROM 
      employees
  );
"""

run_sql(cursor, sql)

    id first_name last_name    salary
0    2    Charlie     Davis  55000.00
1    3      David     Jones  50000.00
2    4       Emma     Brown  48000.00
3    5      Frank    Miller  52000.00
4    6      Grace    Wilson  49000.00
5    7      Harry    Taylor  53000.00
6    8        Ivy     Moore  47000.00
7    9       Jack  Anderson  56000.00
8   10       Kate      Hill  44000.00
9   11       Liam     Clark  59000.00
10  12        Mia    Parker  42000.00

In [3]:
sql = """
SELECT 
  * 
FROM 
  employees 
WHERE 
  salary > ALL(
    select 
      salary 
    from 
      managers
  );
"""

run_sql(cursor, sql)

   id first_name last_name    salary
0   1        Bob  Williams  75000.00

In [6]:
sql = """
SELECT 
  * 
FROM 
  employees 
WHERE 
  salary < ALL(
    select 
      salary 
    from 
      managers
  )
ORDER BY salary DESC;
"""

run_sql(cursor, sql)

   id first_name last_name    salary
0   7      Harry    Taylor  53000.00
1   5      Frank    Miller  52000.00
2   3      David     Jones  50000.00
3   6      Grace    Wilson  49000.00
4   4       Emma     Brown  48000.00
5   8        Ivy     Moore  47000.00
6  10       Kate      Hill  44000.00
7  12        Mia    Parker  42000.00

In [7]:
sql = """
SELECT 
  first_name, 
  last_name 
FROM 
  customer c 
WHERE 
  EXISTS (
    SELECT 
      1 
    FROM 
      payment p 
    WHERE 
      p.customer_id = c.customer_id 
      AND amount > 11
  ) 
ORDER BY 
  first_name, 
  last_name;
"""

run_sql(cursor, sql)

  first_name  last_name
0      Karen    Jackson
1       Kent  Arsenault
2   Nicholas   Barfield
3   Rosemary    Schmidt
4      Tanya    Gilbert
5   Terrance      Roush
6    Vanessa       Sims
7   Victoria     Gibson

In [8]:
sql = """
SELECT 
  first_name, 
  last_name 
FROM 
  customer c 
WHERE 
  NOT EXISTS (
    SELECT 
      1 
    FROM 
      payment p 
    WHERE 
      p.customer_id = c.customer_id 
      AND amount > 11
  ) 
ORDER BY 
  first_name, 
  last_name;
"""

run_sql(cursor, sql)

    first_name last_name
0        Aaron     Selby
1         Adam     Gooch
2       Adrian     Clary
3        Agnes    Bishop
4         Alan      Kahn
..         ...       ...
586     Willie   Markham
587      Wilma  Richards
588    Yolanda    Weaver
589     Yvonne   Watkins
590    Zachary      Hite

[591 rows x 2 columns]

In [9]:
sql = """
SELECT 
  first_name, 
  last_name 
FROM 
  customer 
WHERE 
  EXISTS(
    SELECT NULL
  ) 
ORDER BY 
  first_name, 
  last_name;
"""

run_sql(cursor, sql)

    first_name last_name
0        Aaron     Selby
1         Adam     Gooch
2       Adrian     Clary
3        Agnes    Bishop
4         Alan      Kahn
..         ...       ...
594     Willie   Markham
595      Wilma  Richards
596    Yolanda    Weaver
597     Yvonne   Watkins
598    Zachary      Hite

[599 rows x 2 columns]